Documents/РаспределениеОбщедомовыхПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>РаспределениеОбщедомовыхПриборовУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подъезды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОбщедомовое</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаИндивидуальная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКвартир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Энергоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлощадьОбъектовЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлощадьОбъектовЛицевыхСчетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПотребителейУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыПотребителейУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прописанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проживающие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТарифов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ночной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиковый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РаспределениеОбщедомовыхПриборовУчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура ЗаполнитьНаСервере()
//
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	РасчитыватьЭнергоемкость = Объект.Услуга.РасчитыватьЭнергоемкость;
	
	Если ЗначениеЗаполнено(Объект.УслугаИндивидуальная) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки КАК ЛицевойСчет,
			|	СУММА(РасчетПоказанийПриборовУчетаОбороты.ЗначениеПриход) КАК Значение,
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Период, &ПериодКон) КАК период,
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Действует, ЛОЖЬ) КАК Действует
			|ИЗ
//{{MRG[ <-> ]
			|	РегистрНакопления.РасчетПоказанийПриборовУчета.Обороты(&ПериодНач, &ПериодКон, Месяц, Услуга = &Услуга) КАК РасчетПоказанийПриборовУчетаОбороты
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			|	РегистрНакопления.РасчетПоказанийПриборовУчета.Обороты(
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			|			&ПериодНач,
//			|			&ПериодКон,
//			|			Месяц,
//			|			Услуга = &Услуга
//			|				И ОбъектУстановки.Владелец = &Здание
//			|				И ВЫБОР
//			|					КОГДА &Подъезд <> ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
//			|						ТОГДА ОбъектУстановки.ОбъектЛицевогоСчета.Подъезд = &Подъезд
//			|				КОНЕЦ) КАК РасчетПоказанийПриборовУчетаОбороты
//}}MRG[ <-> ]
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НазначенныеУслуги.СрезПоследних(&ПериодКон, Услуга = &Услуга) КАК НазначенныеУслугиСрезПоследних
			|		ПО РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки = НазначенныеУслугиСрезПоследних.ЛицевойСчет
			|			И РасчетПоказанийПриборовУчетаОбороты.Услуга = НазначенныеУслугиСрезПоследних.Услуга
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки,
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Действует, ЛОЖЬ),
			|	ЕСТЬNULL(НазначенныеУслугиСрезПоследних.Период, &ПериодКон)";
		Запрос.УстановитьПараметр("ПериодНач",	НачалоМесяца(Объект.ПериодНачисления));		
//{{MRG[ <-> ]
		Запрос.УстановитьПараметр("ПериодКон",	КонецМесяца(Объект.ПериодНачисления));		
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Запрос.УстановитьПараметр("ПериодКон",	КонецМесяца(Объект.ПериодНачисления));
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Запрос.УстановитьПараметр("Здание", Объект.Здание);
//		Запрос.УстановитьПараметр("Подъезд", Объект.Подъезд);
//}}MRG[ <-> ]
		Запрос.УстановитьПараметр("Услуга", 	Объект.УслугаИндивидуальная);		
		
		ТаблицаУслугСоСчетчиками = Запрос.Выполнить().Выгрузить();
		
		ТаблицаУслугСоСчетчиками.Колонки.Добавить("Дней", Новый ОписаниеТипов("Число"));
		ЗначениеСоСчетчиками = ТаблицаУслугСоСчетчиками.Итог("Значение");
		МассивЛС = Новый Массив;
		Для каждого Строка  Из ТаблицаУслугСоСчетчиками Цикл
		
			Если НЕ Строка.Действует Тогда 
				
			      Строка.Дней = (НачалоМесяца(Объект.ПериодНачисления) - НачалоДня(Строка.Период))/(60*60*24);
			  Иначе
				  МассивЛС.Добавить(Строка.ЛицевойСчет);
				  Строка.Дней = 0
			
			КонецЕсли; 
		
		КонецЦикла; 
		МассивЛС = ТаблицаУслугСоСчетчиками.ВыгрузитьКолонку("ЛицевойСчет");
	Иначе
		МассивЛС = Новый Массив;
		ЗначениеСоСчетчиками = 0;		
	КонецЕсли; 	
	
	Если ТипЗнч(Объект.Услуга.БазаРаспределенияРасчетнойУслуги) = Тип("ПеречислениеСсылка.ВидыПотребителейУслуг") Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
			|	ВЫБОР
			|		КОГДА &ВидБазыРаспределения = ЗНАЧЕНИЕ(Перечисление.ВидыПотребителейУслуг.Прописанные)
			|			ТОГДА ЛицевыеСчетаСрезПоследних.КоличествоПрописанных
			|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
			|	КОНЕЦ КАК ЗначениеБазы,
			|	&Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
//{{MRG[ <-> ]
//			//|				И НЕ ЛицевойСчет В (&СписокЛицевыхСчетов)
//}}MRG[ <-> ]
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних(&Период, ) КАК ЛицевыеСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
			|	И ЛицевыеСчетаСрезПоследних.ЛицевойСчет.НомерСекции = &НомерСекции
			|	И НазначенныеУслугиСрезПоследних.ЛицевойСчет.НомерСекции = &НомерСекции
			|	И ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.НомерСекции = &НомерСекции
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
			|	ВЫБОР
			|		КОГДА &ВидБазыРаспределения = ЗНАЧЕНИЕ(Перечисление.ВидыПотребителейУслуг.Прописанные)
			|			ТОГДА ЛицевыеСчетаСрезПоследних.КоличествоПрописанных
			|		ИНАЧЕ ЛицевыеСчетаСрезПоследних.КоличествоПроживающих
			|	КОНЕЦ,
			|	НазначенныеУслугиСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
//{{MRG[ <-> ]
//			//|				И НЕ ЛицевойСчет В (&СписокЛицевыхСчетов)
//}}MRG[ <-> ]
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних(&Период, ) КАК ЛицевыеСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ЛОЖЬ
			|	И НазначенныеУслугиСрезПоследних.Период > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
		
	Иначе
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0) КАК ЗначениеБазы,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
			|	&Период КАК Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
//{{MRG[ <-> ]
//			//|				И НЕ ЛицевойСчет В (&СписокЛицевыхСчетов)
//}}MRG[ <-> ]
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
			|	И ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.НомерСекции = &НомерСекции
			|	И НазначенныеУслугиСрезПоследних.ЛицевойСчет.НомерСекции = &НомерСекции
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0),
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
			|	НазначенныеУслугиСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
//{{MRG[ <-> ]
//			//|				И НЕ ЛицевойСчет В (&СписокЛицевыхСчетов)
//}}MRG[ <-> ]
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ЛОЖЬ
			|	И НазначенныеУслугиСрезПоследних.Период > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
			
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("Период", КонецМесяца(Объект.ПериодНачисления));		
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);		
	Запрос.УстановитьПараметр("ВидБазыРаспределения", Объект.Услуга.БазаРаспределенияРасчетнойУслуги);		
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	Запрос.УстановитьПараметр("Подъезд", Объект.Подъезд);
	Запрос.УстановитьПараметр("НомерСекции", Объект.НомерСекции);
	//Запрос.УстановитьПараметр("ГруппаКвартир", Объект.ГруппаКвартир);
	//Запрос.УстановитьПараметр("СписокЛицевыхСчетов", МассивЛС);
	
	ТаблицаЛицевыхСчетов = Запрос.Выполнить().Выгрузить();
	ТаблицаЛицевыхСчетов.Колонки.Добавить("Показание", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
	ТаблицаЛицевыхСчетов.Колонки.Добавить("ЗначениеБазыСКоэффициентом", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 4)));
	
		
	ЗначениеДляРаспределения = Объект.ЗначениеОбщедомовое - ЗначениеСоСчетчиками;
	КонецПериодаРаспределения = КонецМесяца(Объект.ПериодНачисления);
	
	Для каждого Строка Из ТаблицаЛицевыхСчетов Цикл
		
		КоэффициентПоДням = День(Строка.Период)/День(КонецПериодаРаспределения);
		Строка.ЗначениеБазыСКоэффициентом  = Строка.ЗначениеБазы * КоэффициентПоДням; 
			
	КонецЦикла;
	
	ИтогБазы = ТаблицаЛицевыхСчетов.Итог("ЗначениеБазыСКоэффициентом");
	Если ИтогБазы = 0 Тогда
		Сообщить(НСтр("ru='Итог по площади равен нулю.';uk='Підсумок по площі дорівнює нулю.'"));
		Возврат;
	КонецЕсли;

	
	Для каждого Строка Из ТаблицаЛицевыхСчетов Цикл
		
		НоваяСтрока = Объект.Основная.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		//КоэффициентПоДням = День(Строка.Период)/День(КонецПериодаРаспределения);// определим весь месяц или только часть его оказывалась услуга в %
		НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
		НоваяСтрока.Показание = ЗначениеДляРаспределения * (Строка.ЗначениеБазыСКоэффициентом / ИтогБазы);
		Если РасчитыватьЭнергоемкость Тогда
			НоваяСтрока.Энергоемкость = НоваяСтрока.Показание/Строка.ЗначениеБазы;
		Иначе
			НоваяСтрока.Энергоемкость = 0;
		КонецЕсли;	
	КонецЦикла; 
	
	Если Объект.Основная.Количество()> 0 Тогда
	    ГСЧ = Новый ГенераторСлучайныхЧисел();
		СЧ = ГСЧ.СлучайноеЧисло(0,  Объект.Основная.Количество() - 1);

		ЗначениеКорректировки = Объект.Основная.Итог("Показание") - ЗначениеДляРаспределения;	
	    Объект.Основная[СЧ].Показание = Объект.Основная[СЧ].Показание - ЗначениеКорректировки;
		
	КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Основная.Очистить();
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик команды Заполнить.
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	ЗаполнитьНаСервере();	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияПриИзменении(Элемент)
	
	ЭтаФорма.Объект.ПериодНачисления 		= КонецМесяца(ЭтаФорма.Объект.ПериодНачисления);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериодаНачисления 	= Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.ПериодНачисления= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.ПериодНачисления));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.ПериодНачисления = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	

	ЭтаФорма.Объект.ПериодНачисления = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.ПериодНачисления), 
						ДобавитьМесяц(ЭтаФорма.Объект.ПериодНачисления, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры
